In [2]:
import requests
from bs4 import BeautifulSoup

In [3]:
!pip install -U beautifulsoup4

Requirement already up-to-date: beautifulsoup4 in c:\users\mark\anaconda3\lib\site-packages (4.9.1)
Requirement already satisfied, skipping upgrade: soupsieve>1.2 in c:\users\mark\anaconda3\lib\site-packages (from beautifulsoup4) (2.0.1)

In [4]:
def get_price_rank():
    request_url = "https://tw.stock.yahoo.com/d/i/rank.php?t=pri&e=tse&n=100"
    query_string_parameters = {
        't': 'pri',
        'e': 'tse',
        'n': 100
    } 
    response = requests.get( request_url,params = query_string_parameters)
    soup = BeautifulSoup(response.text)
    ticker_stock_name_cs = ".name a"
    price_cs = ".name+ td"
    ticker_stock_name = [e.text for e in soup.select(ticker_stock_name_cs)]
    tickers = [i.split()[0] for i in ticker_stock_name]
    stock_names = [i.split()[1] for i in ticker_stock_name]
    prices = [float(e.text) for e in soup.select(price_cs)]
    return tickers,stock_names,prices

In [5]:
get_price_rank()

(['6116',
  '3682',
  '2409',
  '3481',
  '2603',
  '1609',
  '00677U',
  '00632R',
  '2888',
  '1513',
  '00637L',
  '1305',
  '2303',
  '1314',
  '6443',
  '9958',
  '1802',
  '1304',
  '2337',
  '3037',
  '1310',
  '2417',
  '9105',
  '8926',
  '2010',
  '1309',
  '3047',
  '9103',
  '1312',
  '3576'],
 ['彩晶',
  '亞太電',
  '友達',
  '群創',
  '長榮',
  '大亞',
  '富邦VIX',
  '元大台灣50反1',
  '新光金',
  '中興電',
  '元大滬深300正2',
  '華夏',
  '聯電',
  '中石化',
  '元晶',
  '世紀鋼',
  '台玻',
  '台聚',
  '旺宏',
  '欣興',
  '台苯',
  '圓剛',
  '泰金寶-DR',
  '台汽電',
  '春源',
  '台達化',
  '訊舟',
  '美德醫療-DR',
  '國喬',
  '聯合再生'],
 [9.84,
  11.3,
  12.3,
  10.2,
  18.95,
  17.65,
  5.01,
  8.39,
  8.69,
  54.4,
  21.35,
  22.3,
  23.15,
  8.99,
  27.05,
  135.0,
  13.05,
  16.55,
  32.2,
  72.8,
  17.3,
  62.3,
  6.9,
  43.4,
  11.7,
  29.95,
  16.0,
  54.1,
  20.4,
  11.65])

In [6]:
stock_tickers, stock_names, prices = get_price_rank()
print(stock_tickers)
print(stock_names)
print(prices)

['6116', '3682', '2409', '3481', '2603', '1609', '00677U', '00632R', '2888', '1513', '00637L', '1305', '2303', '1314', '6443', '9958', '1802', '1304', '2337', '3037', '1310', '2417', '9105', '8926', '2010', '1309', '3047', '9103', '1312', '3576']
['彩晶', '亞太電', '友達', '群創', '長榮', '大亞', '富邦VIX', '元大台灣50反1', '新光金', '中興電', '元大滬深300正2', '華夏', '聯電', '中石化', '元晶', '世紀鋼', '台玻', '台聚', '旺宏', '欣興', '台苯', '圓剛', '泰金寶-DR', '台汽電', '春源', '台達化', '訊舟', '美德醫療-DR', '國喬', '聯合再生']
[9.84, 11.3, 12.3, 10.2, 18.95, 17.65, 5.01, 8.39, 8.69, 54.4, 21.35, 22.3, 23.15, 8.99, 27.05, 135.0, 13.05, 16.55, 32.2, 72.8, 17.3, 62.3, 6.9, 43.4, 11.7, 29.95, 16.0, 54.1, 20.4, 11.65]

In [7]:
from statistics import median
#從名字有友達的股票中計算價格中位數
ky_prices = [price for stock_name, price in zip(stock_names, prices) if "友達" in stock_name]
print(len(ky_prices))
print(median(ky_prices))

1
12.3

In [8]:
import pandas as pd

df = pd.DataFrame()
df["ticker"] = stock_tickers
df["stock_name"] = stock_names
df["price"] = prices
df.head()

  ticker stock_name  price
0   6116         彩晶   9.84
1   3682        亞太電  11.30
2   2409         友達  12.30
3   3481         群創  10.20
4   2603         長榮  18.95

In [9]:
df.head

<bound method NDFrame.head of     ticker stock_name   price
0     6116         彩晶    9.84
1     3682        亞太電   11.30
2     2409         友達   12.30
3     3481         群創   10.20
4     2603         長榮   18.95
5     1609         大亞   17.65
6   00677U      富邦VIX    5.01
7   00632R   元大台灣50反1    8.39
8     2888        新光金    8.69
9     1513        中興電   54.40
10  00637L  元大滬深300正2   21.35
11    1305         華夏   22.30
12    2303         聯電   23.15
13    1314        中石化    8.99
14    6443         元晶   27.05
15    9958        世紀鋼  135.00
16    1802         台玻   13.05
17    1304         台聚   16.55
18    2337         旺宏   32.20
19    3037         欣興   72.80
20    1310         台苯   17.30
21    2417         圓剛   62.30
22    9105     泰金寶-DR    6.90
23    8926        台汽電   43.40
24    2010         春源   11.70
25    1309        台達化   29.95
26    3047         訊舟   16.00
27    9103    美德醫療-DR   54.10
28    1312         國喬   20.40
29    3576       聯合再生   11.65>

In [10]:
#判斷股票中有沒有符合友達的名字
print(df['stock_name'].str.contains("友達"))
df[df['stock_name'].str.contains("友達")]

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
Name: stock_name, dtype: bool

  ticker stock_name  price
2   2409         友達   12.3

In [11]:
import pandas as pd

movie_ratings = [8.0, 7.3, 8.5, 8.6]
ser = pd.Series(movie_ratings)
print(type(ser))
print(ser)
print(ser[3])

<class 'pandas.core.series.Series'>
0    8.0
1    7.3
2    8.5
3    8.6
dtype: float64
8.6

In [12]:
movie_ratings = [8.0, 7.3, 8.5, 8.6]
movie_titles = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War", "Avengers: Endgame"]
ser = pd.Series(movie_ratings, index=movie_titles) #可選擇index(預設是0~n)
print(ser)
print(ser["Avengers: Endgame"])
print(ser[2])
print(ser['The Avengers'])

The Avengers               8.0
Avengers: Age of Ultron    7.3
Avengers: Infinity War     8.5
Avengers: Endgame          8.6
dtype: float64
8.6
8.5
8.0

In [13]:
print(ser.index)
print(type(ser.index))
print(ser.values)
print(type(ser.values))

Index(['The Avengers', 'Avengers: Age of Ultron', 'Avengers: Infinity War',
       'Avengers: Endgame'],
      dtype='object')
<class 'pandas.core.indexes.base.Index'>
[8.  7.3 8.5 8.6]
<class 'numpy.ndarray'>

In [14]:
movie_ratings = [8.0, 7.3, 8.5, 8.6]
movie_titles = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War", "Avengers: Endgame"]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

                     title  rating
0             The Avengers     8.0
1  Avengers: Age of Ultron     7.3
2   Avengers: Infinity War     8.5
3        Avengers: Endgame     8.6

In [15]:
movie_ratings = [8.0, 7.3, 8.5, 8.6]
movie_titles = ["The Avengers", "Avengers: Age of Ultron", "Avengers: Infinity War", "Avengers: Endgame"]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
print(df.index)
print(df.columns)
print(df["title"])
print(df["rating"])

RangeIndex(start=0, stop=4, step=1)
Index(['title', 'rating'], dtype='object')
0               The Avengers
1    Avengers: Age of Ultron
2     Avengers: Infinity War
3          Avengers: Endgame
Name: title, dtype: object
0    8.0
1    7.3
2    8.5
3    8.6
Name: rating, dtype: float64

In [16]:
pd_index = pd.Index([0, 2, 3, 4])
print(type(pd_index))
print(pd_index)

<class 'pandas.core.indexes.numeric.Int64Index'>
Int64Index([0, 2, 3, 4], dtype='int64')

In [17]:
pd_index[0] = 1 #index不可直接更新,有不可變的特性

TypeError: Index does not support mutable operations

In [18]:
#集合運算
odds_index = pd.Index([1, 3, 5, 7, 9])
primes_index = pd.Index([2, 3, 5, 7])
print(odds_index & primes_index) # and
print(odds_index | primes_index) # or
print(odds_index ^ primes_index) # exclusive or

Int64Index([3, 5, 7], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9], dtype='int64')
Int64Index([1, 2, 9], dtype='int64')

In [19]:
#常見series創建方式
movie_ratings = [9.0, 8.9, 8.8, 8.7]
ser = pd.Series(movie_ratings)
print(ser)

0    9.0
1    8.9
2    8.8
3    8.7
dtype: float64

In [20]:
#建立ndarray
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
ser = pd.Series(movie_ratings, index=movie_titles)
print(ser.index)
print(ser.values)
print(ser)

Index(['The Dark Knight', 'Schindler's List', 'Forrest Gump', 'Inception'], dtype='object')
[9.  8.9 8.8 8.7]
The Dark Knight     9.0
Schindler's List    8.9
Forrest Gump        8.8
Inception           8.7
dtype: float64

In [21]:
movie_dict = {
    'The Dark Knight' : 9.0,
    "chindler's List" : 8.9,
    'Forrest Gump' : 8.8 , 
    'Inception':8.7
}
ser = pd.Series(movie_dict)
ser

The Dark Knight    9.0
chindler's List    8.9
Forrest Gump       8.8
Inception          8.7
dtype: float64

In [22]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
df

              title  rating
0   The Dark Knight     9.0
1  Schindler's List     8.9
2      Forrest Gump     8.8
3         Inception     8.7

In [23]:
#DF直接匯入dict
movie_dict = {
    'title' : movie_titles,
    'rating': movie_ratings,
}
df = pd.DataFrame(movie_dict)
df

              title  rating
0   The Dark Knight     9.0
1  Schindler's List     8.9
2      Forrest Gump     8.8
3         Inception     8.7

In [24]:
#開csv檔
df = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/movies.csv")
df

              title  rating
0   The Dark Knight     9.0
1  Schindler's List     8.9
2      Forrest Gump     8.8
3         Inception     8.7

In [25]:
#json(用逗號區隔的)
df = pd.read_json("https://python4ds.s3-ap-northeast-1.amazonaws.com/movies.json")
df

              title  rating
0   The Dark Knight     9.0
1  Schindler's List     8.9
2      Forrest Gump     8.8
3         Inception     8.7

In [26]:
#讀excel
df = pd.read_excel("https://python4ds.s3-ap-northeast-1.amazonaws.com/movies.xlsx")
df

              title  rating
0   The Dark Knight     9.0
1  Schindler's List     8.9
2      Forrest Gump     8.8
3         Inception     8.7

In [27]:
import sqlite3

# Creating a demo.db database in working directory
conn = sqlite3.connect('demo.db') # 創建一個暫時的DB
# Importing a table
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
df.to_sql("movies", index=False, con=conn, if_exists='replace')
# Importing data from demo.movies
query_str = """
SELECT *
    FROM movies
    WHERE rating < 9.0;
"""
pd.read_sql(query_str, con=conn)
#查詢sql資料庫

              title  rating
0  Schindler's List     8.9
1      Forrest Gump     8.8
2         Inception     8.7

In [28]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
ser = pd.Series(movie_ratings, index=movie_titles)
print(ser[1:4])

Schindler's List    8.9
Forrest Gump        8.8
Inception           8.7
dtype: float64

In [29]:
print(ser["Schindler's List":"Inception"])

Schindler's List    8.9
Forrest Gump        8.8
Inception           8.7
dtype: float64

In [30]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
ser = pd.Series(movie_ratings, index=movie_titles)
# Fancy indexing
print(ser[[1, 2, 3]])
print(ser[["Schindler's List", "Forrest Gump", "Inception"]])
# Boolean indexing
print(ser < 9)
print(ser[ser < 9]) #挑出小於9分的

Schindler's List    8.9
Forrest Gump        8.8
Inception           8.7
dtype: float64
Schindler's List    8.9
Forrest Gump        8.8
Inception           8.7
dtype: float64
The Dark Knight     False
Schindler's List     True
Forrest Gump         True
Inception            True
dtype: bool
Schindler's List    8.9
Forrest Gump        8.8
Inception           8.7
dtype: float64

In [31]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
release_years = [2008, 1993, 1994, 2010]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
df["release_year"] = release_years
print(df["title"]) #呼叫欄位方式1
print(df.rating) #呼叫欄位方式2
df[["title", "release_year"]] # 看想選哪些欄位出來

0     The Dark Knight
1    Schindler's List
2        Forrest Gump
3           Inception
Name: title, dtype: object
0    9.0
1    8.9
2    8.8
3    8.7
Name: rating, dtype: float64

              title  release_year
0   The Dark Knight          2008
1  Schindler's List          1993
2      Forrest Gump          1994
3         Inception          2010

In [32]:
df = pd.DataFrame()
df["rating"] = movie_ratings
df["release_year"] = release_years
df.index = movie_titles
df

                  rating  release_year
The Dark Knight      9.0          2008
Schindler's List     8.9          1993
Forrest Gump         8.8          1994
Inception            8.7          2010

In [33]:
df = pd.DataFrame()
df["rating"] = movie_ratings
df["release_year"] = release_years
df.index = movie_titles
df.loc[["The Dark Knight", "Inception"], ["rating", "release_year"]]

                 rating  release_year
The Dark Knight     9.0          2008
Inception           8.7          2010

In [34]:
df.loc['The Dark Knight','rating']

9.0

In [35]:
df["rating"] = movie_ratings
df["release_year"] = release_years
df.index = movie_titles
df.iloc[[0, 3], [0, 1]] #用坐標軸來看
#df.iloc[[0, 3], :]  欄全選,效果同上一行

                 rating  release_year
The Dark Knight     9.0          2008
Inception           8.7          2010

In [36]:
df.iloc[0,0]

9.0

In [39]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
release_years = [2008, 1993, 1994, 2010]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
df["release_year"] = release_years
df.sort_index(ascending=False) # default: ascending

              title  rating  release_year
3         Inception     8.7          2010
2      Forrest Gump     8.8          1994
1  Schindler's List     8.9          1993
0   The Dark Knight     9.0          2008

In [42]:
df.sort_values('release_year' , ascending = False)

              title  rating  release_year
3         Inception     8.7          2010
0   The Dark Knight     9.0          2008
2      Forrest Gump     8.8          1994
1  Schindler's List     8.9          1993

In [56]:
# 讀取csv然後計算bmi
player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
player_profile.head(5)

,collegeName,country,dateOfBirthUTC,firstName,heightFeet,heightInches,heightMeters,isActive,jersey,lastAffiliation,lastName,nbaDebutYear,personId,pos,teamId,temporaryDisplayName,weightKilograms,weightPounds,yearsPro
0,Pittsburgh,New Zealand,1993-07-20,Steven,7,0,2.13,1,12.0,Pittsburgh/New Zealand,Adams,2013.0,203500,C,1610612760,"Adams, Steven",120.2,265.0,6.0
1,Kentucky,USA,1997-07-18,Bam,6,10,2.08,1,13.0,Kentucky/USA,Adebayo,2017.0,1628389,C-F,1610612748,"Adebayo, Bam",115.7,255.0,2.0
2,University of Louisville,South Sudan,1997-02-01,Deng,6,7,2.01,1,NaN,South Sudan/South Sudan,Adel,2018.0,1629061,F,1610612751,"Adel, Deng",90.7,200.0,1.0
3,Texas,USA,1985-07-19,LaMarcus,6,11,2.11,1,12.0,Texas/USA,Aldridge,2006.0,200746,C-F,1610612759,"Aldridge, LaMarcus",117.9,260.0,13.0
4,Tennessee,Canada,1996-10-21,Kyle,6,11,2.11,1,NaN,Tennessee/Canada,Alexander,NaN,1629734,F,1610612748,"Alexander, Kyle",99.8,220.0,0.0

In [47]:
player_profile["bmi"] = player_profile["weightKilograms"] / player_profile["heightMeters"]**2
# 衍生變數,原本沒有的
player_profile[["temporaryDisplayName", "bmi"]].head()

  temporaryDisplayName        bmi
0        Adams, Steven  26.493861
1         Adebayo, Bam  26.742788
2           Adel, Deng  22.449939
3   Aldridge, LaMarcus  26.481885
4      Alexander, Kyle  22.416388

In [49]:
player_profile['pos'].value_counts()

G      200
F      186
C       51
G-F     39
F-C     20
F-G     15
C-F     13
Name: pos, dtype: int64

In [50]:
pos_dict = {
    "G": "Backcourt",
    "F": "Frontcourt",
    "C": "Frontcourt",
    "G-F": "Backcourt",
    "F-C": "Frontcourt",
    "F-G": "Frontcourt",
    "C-F": "Frontcourt"
}

In [51]:
player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
print("Pos before mapping:")
player_profile["pos"].value_counts()

Pos before mapping:

G      200
F      186
C       51
G-F     39
F-C     20
F-G     15
C-F     13
Name: pos, dtype: int64

In [52]:
# 類別對應類別
print("Pos after mapping:")
player_profile["pos_recoded"] = player_profile["pos"].map(pos_dict)
player_profile["pos_recoded"].value_counts()

Pos after mapping:

Frontcourt    285
Backcourt     239
Name: pos_recoded, dtype: int64

In [58]:
#數值對應類別
import numpy as np

player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
#cut成三個切點,一個是0~2之間,一個是2~無限大(np.Inf),3個切點就能分成兩類
player_profile["heightCategory"] = pd.cut(player_profile["heightMeters"], [0, 2, np.Inf], labels=["<= 2m", "> 2m"])
player_profile[["temporaryDisplayName", "heightMeters", "heightCategory"]].head(10)

        temporaryDisplayName  heightMeters heightCategory
0              Adams, Steven          2.13           > 2m
1               Adebayo, Bam          2.08           > 2m
2                 Adel, Deng          2.01           > 2m
3         Aldridge, LaMarcus          2.11           > 2m
4            Alexander, Kyle          2.11           > 2m
5  Alexander-Walker, Nickeil          1.96          <= 2m
6             Allen, Grayson          1.96          <= 2m
7             Allen, Jarrett          2.11           > 2m
8              Allen, Kadeem          1.90          <= 2m
9           Aminu, Al-Farouq          2.06           > 2m

In [60]:
#函數映射
#開頭第一個字是G,就改成G 以此類推,簡化分類
def recode_pos(x):
    if x[0] == 'G':
        return 'G'
    elif x[0] == 'F':
        return 'F'
    elif x[0] == 'C':
        return 'C'

player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
player_profile["pos_recoded"] = player_profile["pos"].apply(recode_pos)
print("Pos before applying:")
player_profile["pos"].value_counts()

Pos before applying:

G      200
F      186
C       51
G-F     39
F-C     20
F-G     15
C-F     13
Name: pos, dtype: int64

In [63]:
print("Pos after applying")
player_profile["pos_recoded"].value_counts()

Pos after applying

G    239
F    221
C     64
Name: pos_recoded, dtype: int64

In [65]:
df

              title  rating  release_year
0   The Dark Knight     9.0          2008
1  Schindler's List     8.9          1993
2      Forrest Gump     8.8          1994
3         Inception     8.7          2010

In [66]:
df.max() # 這樣會直接對欄作用排序

title           The Dark Knight
rating                        9
release_year               2010
dtype: object

In [67]:
df.max(axis=1) #每一列的最大值

0    2008.0
1    1993.0
2    1994.0
3    2010.0
dtype: float64

In [72]:
df['rating'].min() # 指定欄位做摘要

8.7

In [75]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
release_years = [2008, 1993, 1994, 2010]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
df["release_year"] = release_years
df = df.set_index('title')
df

                  rating  release_year
title
The Dark Knight      9.0          2008
Schindler's List     8.9          1993
Forrest Gump         8.8          1994
Inception            8.7          2010

In [76]:
df['release_year'].min()

1993

In [81]:
df['release_year'].idxmin() #可用來找出是哪個索引的

"Schindler's List"

In [82]:
df['rating'].max()

9.0

In [83]:
df['rating'].idxmax()

'The Dark Knight'

In [85]:
#隨堂練習:誰的背號數字最大？

In [98]:
import pandas as pd

numbers = [9, 23, 33, 91, 13]
players = ["Ron Harper", "Michael Jordan", "Scottie Pippen", "Dennis Rodman", "Luc Longley"]
df = pd.DataFrame()
df["number"] = numbers
df["player"] = players
df

   number          player
0       9      Ron Harper
1      23  Michael Jordan
2      33  Scottie Pippen
3      91   Dennis Rodman
4      13     Luc Longley

In [95]:
#法一
df = df.set_index('player')
df

                number
player
Ron Harper           9
Michael Jordan      23
Scottie Pippen      33
Dennis Rodman       91
Luc Longley         13

In [96]:
df['number'].idxmax()

'Dennis Rodman'

In [99]:
#法二
df.set_index("player")["number"].idxmax()

'Dennis Rodman'

In [102]:
player_profile = pd.read_csv("https://python4ds.s3-ap-northeast-1.amazonaws.com/player_profile.csv")
player_profile['country']

0      New Zealand
1              USA
2      South Sudan
3              USA
4           Canada
          ...
519            USA
520            USA
521            USA
522        Croatia
523        Croatia
Name: country, Length: 524, dtype: object

In [103]:
player_profile['country'].nunique()

42

In [104]:
player_profile['country'].unique()

array(['New Zealand', 'USA', 'South Sudan', 'Canada', 'Greece',
       'United Kingdom', 'Bahamas', 'France', 'Australia', 'Italy',
       'Croatia', 'Latvia', 'Georgia', 'Democratic Republic of the Congo',
       'Serbia', 'Sudan', 'Germany', 'Lithuania', 'Brazil', 'Slovenia',
       'Switzerland', nan, 'Mali', 'Senegal', 'Guinea', 'Cameroon',
       'Angola', ' ', 'Spain', 'Yugoslavia', 'Japan',
       'Dominican Republic', 'Turkey', 'Haiti', 'Ukraine', 'Finland',
       'Bosnia and Herzegovina', 'Egypt', 'Nigeria', 'Austria',
       'Czech Republic', 'Gabon', 'Montenegro'], dtype=object)

In [107]:
player_profile['country'].value_counts()

USA                                 393
Canada                               20
France                               12
Australia                            10
Croatia                               7
Germany                               6
Serbia                                6
Spain                                 5
Turkey                                4
Lithuania                             4
Brazil                                3
Latvia                                3
Slovenia                              3
Italy                                 3
Democratic Republic of the Congo      3
Greece                                3
Bosnia and Herzegovina                2
Cameroon                              2
Senegal                               2
South Sudan                           2
Japan                                 2
Bahamas                               2
United Kingdom                        2
Mali                                  2
Sudan                                 2
Ukraine                               2
Austria                               1
Nigeria                               1
Czech Republic                        1
Haiti                                 1
Egypt                                 1
Switzerland                           1
Angola                                1
New Zealand                           1
Guinea                                1
                                      1
Montenegro                            1
Georgia                               1
Gabon                                 1
Yugoslavia                            1
Dominican Republic                    1
Finland                               1
Name: country, dtype: int64

In [112]:
#用pos做分組
groupby_object = player_profile.groupby("pos")
print(groupby_object["heightMeters"].mean()) # Average height by pos
print("\n")
print(groupby_object["weightKilograms"].mean()) # Average weight by pos

pos
C      2.126863
C-F    2.090000
F      2.044378
F-C    2.107500
F-G    1.995333
G      1.924800
G-F    2.000000
Name: heightMeters, dtype: float64


pos
C      114.335294
C-F    110.676923
F      101.589730
F-C    110.855000
F-G     95.126667
G       88.896000
G-F     95.717949
Name: weightKilograms, dtype: float64

In [111]:
player_profile['heightMeters'].mean()

2.0055258126194997

In [113]:
groupby_object

In [117]:
movie_ratings = [9.0, 8.9, 8.8, 8.7]
movie_titles = ["The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
release_years = [2008, 1993, 1994, 2010]
df = pd.DataFrame()
df["title"] = movie_titles
df["rating"] = movie_ratings
df["release_year"] = release_years
df

              title  rating  release_year
0   The Dark Knight     9.0          2008
1  Schindler's List     8.9          1993
2      Forrest Gump     8.8          1994
3         Inception     8.7          2010

In [118]:
df = df.set_index('title')
df

                  rating  release_year
title
The Dark Knight      9.0          2008
Schindler's List     8.9          1993
Forrest Gump         8.8          1994
Inception            8.7          2010

In [119]:
df = df.reset_index()
df

              title  rating  release_year
0   The Dark Knight     9.0          2008
1  Schindler's List     8.9          1993
2      Forrest Gump     8.8          1994
3         Inception     8.7          2010

In [123]:
final_df = df[df['release_year'] > 2005]
final_df

             title  rating  release_year
0  The Dark Knight     9.0          2008
3        Inception     8.7          2010

In [124]:
final_df.reset_index()

   index            title  rating  release_year
0      0  The Dark Knight     9.0          2008
1      3        Inception     8.7          2010

In [126]:
#把舊的索引砍掉
final_df.reset_index(drop=True)

             title  rating  release_year
0  The Dark Knight     9.0          2008
1        Inception     8.7          2010